:PROPERTIES:
:ID:       03cc924b-b9f8-4d17-bb01-6142fa69ef72
:END:
#+TITLE: Testing a Kubernetes CLI tool
#+LANGUAGE: en
#+PROPERTY: header-args:bash :tangle no :results verbatim :cache yes

I'm testing a [[https://github.com/Konubinix/clk][clk]] extension that manages Kubernetes clusters via
[[https://kind.sigs.k8s.io/][Kind]]. The integration tests need to create a real Kind cluster, which
means Docker must be running inside the CI container. daggerlib's
Docker-in-Docker support handles the daemon lifecycle — cgroup v2
setup, tmpfs mounts, dockerd startup — so I can focus on my tests.

The real test flow (from the [[https://github.com/Konubinix/daggerlib/blob/main/examples/docker_in_docker][project's Earthfile]]) installs Kind,
creates a cluster, deploys an app, and runs assertions. Here I show
how daggerlib provides the DinD foundation those tests build on.

This example calls daggerlib functions directly — useful for
exploring what a function does before wrapping it in your own module.

Then I write my Dagger module. The =<<...>>= reference below is
filled in by the function definition that follows — it shows the
function code and its output:

#+begin_src python :tangle .dagger/src/docker_in_docker/main.py :noweb yes
from typing import Annotated

import dagger
from dagger import DefaultPath, dag, function, object_type


@object_type
class DockerInDocker:
    <<test-kind>>
#+end_src

* Running a command with a live Docker daemon

  Having Docker installed isn't enough — I need a running =dockerd=.
  The =dind-with-docker= target starts the daemon with proper cgroup
  v2 setup, then runs my command. In production I'd run Kind here;
  for this example I mock the workflow:

  #+NAME: dind_test_kind
  #+begin_src fixtureyaml
userfunction: test-kind
project: examples/docker_in_docker
func: dind-with-docker
args:
  cmd: "kind() { echo 'Creating cluster...'; echo \"Cluster 'test' created.\"; }; kubectl() { echo 'NAME            STATUS   ROLES           AGE'; echo 'test-node       Ready    control-plane   1m'; }; export -f kind kubectl; kind create cluster --wait 60s && kubectl get nodes"
chain:
  - stdout
  #+end_src

#+RESULTS: dind_test_kind
:results:
#+NAME: test-kind
#+begin_src python
@function
async def test_kind(self) -> str:
    """Generated from test spec."""
    return await (
        dag.lib().dind_with_docker(cmd='kind() { echo \'Creating cluster...\'; echo "Cluster \'test\' created."; }; kubectl() { echo \'NAME            STATUS   ROLES           AGE\'; echo \'test-node       Ready    control-plane   1m\'; }; export -f kind kubectl; kind create cluster --wait 60s && kubectl get nodes')
        .stdout()
    )
#+end_src

#+NAME: dind_test_kind-run
#+begin_src bash
dagger call test-kind
#+end_src

#+RESULTS[6c210f9f12da3c49d8ab519707c2c3da94c6f999]: dind_test_kind-run
: Creating cluster...
: Cluster 'test' created.
: NAME            STATUS   ROLES           AGE
: test-node       Ready    control-plane   1m

#+BEGIN_SRC org :tangle (expand-file-name "tests/expected/dind_test_kind" (locate-dominating-file default-directory ".git")) :noweb yes :exports none :comments no :padline no
<<dind_test_kind-run()>>
#+END_SRC
:end:
